---
type: BalusterPlacement
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 7
tags: [revit-api, class]
---

# BalusterPlacement

`Autodesk.Revit.DB.Architecture.BalusterPlacement` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | BalusterPattern | 2019 | `public BalusterPattern BalusterPattern { get ; }` |
| Property | BalusterPerTreadFamilyId | 2019 | `public ElementId BalusterPerTreadFamilyId { get ; set ; }` |
| Property | BalusterPerTreadNumber | 2019 | `public int BalusterPerTreadNumber { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | PostPattern | 2019 | `public PostPattern PostPattern { get ; }` |
| Property | UseBalusterPerTreadOnStairs | 2019 | `public bool UseBalusterPerTreadOnStairs { get ; set ; }` |